# Задача: используя цикл запрашивайте у пользователя число пока оно не станет больше 0, но меньше 10.
# После того, как пользователь введет корректное число, возведите его в степерь 2 и выведите на экран.
# Например, пользователь вводит число 123, вы сообщаете ему, что число не верное,
# и сообщаете об диапазоне допустимых. И просите ввести заного.
# Допустим пользователь ввел 2, оно подходит, возводим в степень 2, и выводим 4

x = int(input('Input a number: '))
while not (0 < x < 10):
    print('The number incorrect. Valid range is 0 < x < 10.')
    x = int(input('Input a number: '))
print(x ** 2)
