# Задача-1: поработайте с переменными, создайте несколько,
# выведите на экран, запросите от пользователя и сохраните в переменную, выведите на экран
i = 5
f = 5.0
s = '25'
b = False

print(i, f, s, b)
print((str(int(i * f)) == s) != b)

usr_name = input('Your name: ')
print(f'Hello, {usr_name}!')
